src/Reports/инк6НДФЛ/инк6НДФЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>инк6НДФЛ</name>
</mdclass:Report>

src/Catalogs/инкОрганизации/инкОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>инкОрганизации</name>
  <attributes>
    <name>Бухгалтер</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОтпускДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИФНСАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИФНСКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИФНСНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИФНСТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кадровик</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>КодНалоговогоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКАТО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКДП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКОПФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКТМО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКФС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойОтпускДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредприятиеМалогоИлиСреднегоБизнеса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйСчет</name>
    <type>
      <types>CatalogRef.инкРасчетныеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоКемВыдано</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоСерия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СистемаНалогооблажения</name>
    <type>
      <types>EnumRef.инкСистемаНалогооблажения</types>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоМесяцаВыплатыЗарплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Reports/инк6НДФЛ/ObjectModule.bsl
#Область о // Сформировать табличные документы:

Функция СформироватьТабличныеДокументы(ДокументСсылка) Экспорт
	
	ТабличныеДокументы = Новый Структура;	
	ТабличныеДокументы.Вставить("ТитулТаблица",Новый ТабличныйДокумент);
	ТабличныеДокументы.Вставить("Раздел1Таблица",Новый ТабличныйДокумент);
	ТабличныеДокументы.Вставить("Раздел2Таблица",Новый ТабличныйДокумент);

	ИсходныеДанные = ПолучитьИсходныеДанные(ДокументСсылка);
	
	СформироватьТитульныйЛист(ТабличныеДокументы,ИсходныеДанные);
	СформироватьРаздел1(ТабличныеДокументы,ИсходныеДанные);
	СформироватьРаздел2(ТабличныеДокументы,ИсходныеДанные);
	
	Возврат ТабличныеДокументы;
	
КонецФункции

Процедура СформироватьТитульныйЛист(ТабличныеДокументы,ИсходныеДанные)
	
	ТабличныйДокумент = ТабличныеДокументы.ТитулТаблица;
	
	Макет = ПолучитьМакет("ПечатныйБланк2024Кв2_Титульный");
	ОбластьТаблицы = Макет.ПолучитьОбласть("ОсновнаяЧасть");
	
	инкОтчетыСервер.ВывестиДанныеВОбласти("ИНН",ИсходныеДанные.ИНН,ОбластьТаблицы);
	инкОтчетыСервер.ВывестиДанныеВОбласти("КПП",ИсходныеДанные.КПП,ОбластьТаблицы);
    инкОтчетыСервер.ВывестиДанныеВОбласти("НомерКорректировки",ИсходныеДанные.ДокументСсылка.НомерКорректировки,ОбластьТаблицы);
    инкОтчетыСервер.ВывестиДанныеВОбласти("Период",ИсходныеДанные.Период,ОбластьТаблицы);
    инкОтчетыСервер.ВывестиДанныеВОбласти("ОтчетГод",ИсходныеДанные.ОтчетГод,ОбластьТаблицы);
    инкОтчетыСервер.ВывестиДанныеВОбласти("НалоговыйОрган",ИсходныеДанные.НалоговыйОрган,ОбластьТаблицы);   
	инкОтчетыСервер.ВывестиДанныеВОбласти("ОГРНИП",ИсходныеДанные.ОГРНИП,ОбластьТаблицы);   
	инкОтчетыСервер.ВывестиДанныеВОбласти("ОКТМО",ИсходныеДанные.ОКТМО,ОбластьТаблицы);   
	инкОтчетыСервер.ВывестиДанныеВОбласти("ПоМесту",ИсходныеДанные.ПоМесту,ОбластьТаблицы);
    инкОтчетыСервер.ВывестиДанныеВОбласти("НаимОрг",ИсходныеДанные.НаимОрг,ОбластьТаблицы);
    инкОтчетыСервер.ВывестиДанныеВОбласти("ТелОрганизации",ИсходныеДанные.ТелОрганизации,ОбластьТаблицы);
	инкОтчетыСервер.ВывестиДанныеВОбласти("ПрПодп",ИсходныеДанные.ПрПодп,ОбластьТаблицы);
	инкОтчетыСервер.ВывестиДанныеВОбласти("ОргПодписантФамилия",ИсходныеДанные.ОргПодписантФамилия,ОбластьТаблицы);
	инкОтчетыСервер.ВывестиДанныеВОбласти("ОргПодписантИмя",ИсходныеДанные.ОргПодписантИмя,ОбластьТаблицы);
	инкОтчетыСервер.ВывестиДанныеВОбласти("ОргПодписантОтчество",ИсходныеДанные.ОргПодписантОтчество,ОбластьТаблицы);
	инкОтчетыСервер.ВывестиДанныеВОбласти("ДатаПодписи",ИсходныеДанные.ДатаПодписи,ОбластьТаблицы);
	
	ТабличныйДокумент.Вывести(ОбластьТаблицы); 
	
КонецПроцедуры

Процедура СформироватьРаздел1(ТабличныеДокументы,ИсходныеДанные)
	
	ТабличныйДокумент = ТабличныеДокументы.Раздел1Таблица;
	
	Макет = ПолучитьМакет("ПечатныйБланк2024Кв2_Раздел1");
	ОбластьТаблицы = Макет.ПолучитьОбласть("ОсновнаяЧасть");
	
	инкОтчетыСервер.ВывестиДанныеВОбласти("ИНН",ИсходныеДанные.ИНН,ОбластьТаблицы);
	инкОтчетыСервер.ВывестиДанныеВОбласти("КПП",ИсходныеДанные.КПП,ОбластьТаблицы);   
	инкОтчетыСервер.ВывестиДанныеВОбласти("НомСтр","002",ОбластьТаблицы);  
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000010001001",ИсходныеДанные.КодБюджетнойКлассификации,ОбластьТаблицы);  
	
	// 020:
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000010002001",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.СуммаНалога),ОбластьТаблицы);
	
	// 021-024:
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000010002101",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.Реквизит_021),ОбластьТаблицы);
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000010002201",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.Реквизит_022),ОбластьТаблицы);
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000010002301",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.Реквизит_023),ОбластьТаблицы);
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000010002401",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.Реквизит_024),ОбластьТаблицы);
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000010002501",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.Реквизит_025),ОбластьТаблицы);
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000010002601",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.Реквизит_026),ОбластьТаблицы);

	инкОтчетыСервер.ВывестиДанныеВОбласти("П000010003001",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.ВозвратНалога.Итог("СуммаНалога")),ОбластьТаблицы);

	Для каждого ВозвратНалогаСтрока Из ИсходныеДанные.ДокументСсылка.ВозвратНалога Цикл

		ОбластьИмя = "П000010003"+ВозвратНалогаСтрока.НомерСтроки+"01_";	
		СуммаСтрока = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Формат(ВозвратНалогаСтрока.СуммаНалога,"ЧДЦ=2; ЧРД=.; ЧН=0.00; ЧГ="), 15, " ", "Слева");
		инкОтчетыСервер.ВывестиДанныеВОбласти(ОбластьИмя,СуммаСтрока,ОбластьТаблицы);
		
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(ОбластьТаблицы); 
	
КонецПроцедуры   

Процедура СформироватьРаздел2(ТабличныеДокументы,ИсходныеДанные)

	ТабличныйДокумент = ТабличныеДокументы.Раздел2Таблица;
	
	Макет = ПолучитьМакет("ПечатныйБланк2024Кв2_Раздел2");
	ОбластьТаблицы = Макет.ПолучитьОбласть("ОсновнаяЧасть1");
	
	инкОтчетыСервер.ВывестиДанныеВОбласти("ИНН",ИсходныеДанные.ИНН,ОбластьТаблицы);
	инкОтчетыСервер.ВывестиДанныеВОбласти("КПП",ИсходныеДанные.КПП,ОбластьТаблицы);   
	инкОтчетыСервер.ВывестиДанныеВОбласти("НомСтр","003",ОбластьТаблицы);   
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020010501",ИсходныеДанные.КодБюджетнойКлассификации,ОбластьТаблицы);  
	
	// Процент:
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020010001","13",ОбластьТаблицы);  
	
	// Сумма дохода, начисленная физическим лицам:
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020011003",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.СуммаДохода),ОбластьТаблицы);   
	// В том числе:
	//  сумма дохода, начисленная в виде дивидендов
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020011103",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.Реквизит_111),ОбластьТаблицы);   
	//  сумма дохода, начисленная по трудовым договорам (контрактам)
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020011203",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.СуммаЗарплата),ОбластьТаблицы);   
	//  " сумма дохода, начисленная по гражданско-правовым договорам,
	// предметом которых являются выполнение работ (оказание услуг)"
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020011303",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.СуммаГПХ),ОбластьТаблицы);   
	ТабличныйДокумент.Вывести(ОбластьТаблицы);  
	
	// Количество физических лиц, получивших доход:
	ОбластьТаблицы = Макет.ПолучитьОбласть("КолФЛ_Длина7");
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020011003",СтроковаяСуммаЦелое(ИсходныеДанные.ДокументСсылка.КоличествоЛицПолучившихДоход,7),ОбластьТаблицы);   
	ТабличныйДокумент.Вывести(ОбластьТаблицы);  
	
	ОбластьТаблицы = Макет.ПолучитьОбласть("КолКвал_Длина7");
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020011103",СтроковаяСуммаЦелое(ИсходныеДанные.ДокументСсылка.Реквизит_111,7),ОбластьТаблицы);   
	ТабличныйДокумент.Вывести(ОбластьТаблицы);  
	
	ОбластьТаблицы = Макет.ПолучитьОбласть("ОсновнаяЧасть2");
	// Сумма дохода, полученная физическими лицами:
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020012003",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.СуммаДоходаПолученнаяФизическимиЛицами),ОбластьТаблицы);   
	// " в том числе сумма дохода, полученная высококвалифицированными специалистами"
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020012103",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.СуммаДоходаПолученнаяФизическимиЛицамиСпециалисты),ОбластьТаблицы);   
	// Налоговая база:
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020013103",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.СуммаНалогаБаза),ОбластьТаблицы);   
	// Сумма вычетов:
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020013003",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.СуммаВычеты),ОбластьТаблицы);   
	// Сумма налога исчисленная:
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020014003",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.СуммаНалогаИсчисленная),ОбластьТаблицы);   
	// 141:
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020014103",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.Реквизит_141),ОбластьТаблицы);   
	// 150:
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020015003",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.Реквизит_150),ОбластьТаблицы);   
	// 155:
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020015503",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.Реквизит_155),ОбластьТаблицы);   
	// 156:
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020015603",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.Реквизит_156),ОбластьТаблицы);   
	// 161:
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020016103",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.Реквизит_161),ОбластьТаблицы);   
	// 162:
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020016203",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.Реквизит_162),ОбластьТаблицы);   
	// 163:
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020016303",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.Реквизит_163),ОбластьТаблицы);   
	// 164:
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020016403",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.Реквизит_164),ОбластьТаблицы);   
	// 165:
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020016503",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.Реквизит_165),ОбластьТаблицы);   
	// 166:
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020016603",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.Реквизит_166),ОбластьТаблицы);   
	// 191:
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020019103",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.Реквизит_191),ОбластьТаблицы);   
	// 192:
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020019203",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.Реквизит_192),ОбластьТаблицы);   
	// 193:
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020019303",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.Реквизит_193),ОбластьТаблицы);   
	// 194:
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020019403",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.Реквизит_194),ОбластьТаблицы);   
	// 195:
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020019503",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.Реквизит_195),ОбластьТаблицы);   
	// 196:
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020019603",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.Реквизит_196),ОбластьТаблицы);   
	// Сумма налога удержанная:
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020016003",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.СуммаНалогаУдержанная),ОбластьТаблицы);   
	// Сумма налога, не удержанная налоговым агентом:
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020017003",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.СуммаНалогаНеУдержанная),ОбластьТаблицы);   
	// Сумма налога, излишне удержанная:
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020018003",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.СуммаНалогаИзлишнеУдержанная),ОбластьТаблицы);   
	// Сумма налога, возвращенная налоговым агентом:
	инкОтчетыСервер.ВывестиДанныеВОбласти("П000020019003",СтроковаяСуммаОбщая(ИсходныеДанные.ДокументСсылка.СуммаНалогаВозвращенного),ОбластьТаблицы);   
	
	ТабличныйДокумент.Вывести(ОбластьТаблицы); 

КонецПроцедуры   

Функция СтроковаяСуммаОбщая(СуммаЧисло,ДлинаСтроки = 15)
	
	СуммаСтрока = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Формат(СуммаЧисло,"ЧДЦ=2; ЧРД=.; ЧН=0.00; ЧГ="), ДлинаСтроки, " ", "Слева");
	Возврат СуммаСтрока;
	
КонецФункции      

Функция СтроковаяСуммаЦелое(СуммаЧисло,ДлинаСтроки = 6)

	СуммаСтрока = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Формат(СуммаЧисло,"ЧДЦ=0; ЧН=0; ЧГ="), ДлинаСтроки, " ", "Слева");
	Возврат СуммаСтрока;

КонецФункции	

#КонецОбласти     

#Область о // Исходные данные:

Функция ПолучитьИсходныеДанные(ДокументСсылка) 

	ИсходныеДанные = Новый Структура;                       
	
	Организация	= ДокументСсылка.Организация;
	ПериодДата	= ДокументСсылка.ПериодДата;
	
	ПериодОтчета = инкОбщийСервер.СтандартныйПериодПоГодуИПериодуРегламентногоОтчета(Год(ПериодДата), ДокументСсылка.ПериодРегламентногоОтчета);
	
	ИсходныеДанные.Вставить("ДокументСсылка",ДокументСсылка);                
	
	ИсходныеДанные.Вставить("Дата1",ПериодОтчета.ДатаНачала);                
	ИсходныеДанные.Вставить("Дата2",ПериодОтчета.ДатаОкончания);   
	ИсходныеДанные.Вставить("Организация",Организация);   
	
	ИсходныеДанные.Вставить("ИНН",Организация.ИНН);
	ИсходныеДанные.Вставить("КПП",Организация.КПП); 
	
    ИсходныеДанные.Вставить("Период",Формат(ПериодДата,"ДФ=MM"));
    ИсходныеДанные.Вставить("ОтчетГод",Формат(ПериодДата,"ДФ=yyyy"));
    ИсходныеДанные.Вставить("НалоговыйОрган",Организация.ИФНСКод);   
	
	ИсходныеДанные.Вставить("ОГРНИП");
	ИсходныеДанные.Вставить("ПоМесту","214");
	ИсходныеДанные.Вставить("ИндивидуальныйПредприниматель",(СтрДлина(Организация.ИНН) = 12));
	
	ИсходныеДанные.Вставить("КодБюджетнойКлассификации","18210102010011000110");
	
	Если ИсходныеДанные.ИндивидуальныйПредприниматель Тогда
		ИсходныеДанные.ОГРНИП = Организация.ОГРН;   
		ИсходныеДанные.ПоМесту = "120";	
	КонецЕсли;	
	
    ИсходныеДанные.Вставить("ОКТМО",Организация.ОКТМО);
    ИсходныеДанные.Вставить("НаимОрг",Организация.Наименование);
	
	ТелОрганизации = Справочники.инкОрганизации.ПолучитьКонтактныйТелефонОрганизации(Организация);
    ИсходныеДанные.Вставить("ТелОрганизации",ТелОрганизации);
	
	ИсходныеДанные.Вставить("ПрПодп","1");
	
	ИсходныеДанные.Вставить("ОргПодписантФамилия",Организация.Руководитель.Фамилия);
	ИсходныеДанные.Вставить("ОргПодписантИмя",Организация.Руководитель.Имя);
	ИсходныеДанные.Вставить("ОргПодписантОтчество",Организация.Руководитель.Отчество);
	
	ИсходныеДанные.Вставить("ДатаПодписи",Формат(ТекущаяДата(),"ДФ=ddMMyyyy"));
	
	ИсходныеДанные.Вставить("ДатаДок",  Формат(ДокументСсылка.Дата,"ДФ=dd.MM.yyyy"));
	ИсходныеДанные.Вставить("КодНО",    Организация.ИФНСКод);
	ИсходныеДанные.Вставить("НомКорр",  ДокументСсылка.НомерКорректировки);
	
	ИсходныеДанные.Вставить("КодИФНСПосредника","");
	
	ИсходныеДанные.Вставить("Тлф", ТелОрганизации);
	
	ИсходныеДанные.Вставить("ФормРеорг", "");
	ИсходныеДанные.Вставить("ИННРеорг",  "");
	ИсходныеДанные.Вставить("КППРеорг",  "");
	
	ФИОИП = Новый Структура;
	ФИОИП.Вставить("Фамилия");
	ФИОИП.Вставить("Имя");
	ФИОИП.Вставить("Отчество");
	
	Если ИсходныеДанные.ИндивидуальныйПредприниматель Тогда
		ФИОИП.Фамилия	= Организация.Руководитель.Фамилия;
		ФИОИП.Имя		= Организация.Руководитель.Имя;
		ФИОИП.Отчество	= Организация.Руководитель.Отчество;
	КонецЕсли;
	
	ИсходныеДанные.Вставить("ФИОИП", ФИОИП);
	
	ИсходныеДанные.Вставить("ПрПодп","1");
	ИсходныеДанные.Вставить("НаимОргПред", "");
	ИсходныеДанные.Вставить("НаимДокПред", "");

	ФИОПодписанта = Новый Структура;
	ФИОПодписанта.Вставить("Фамилия",Организация.Руководитель.Фамилия);
	ФИОПодписанта.Вставить("Имя",Организация.Руководитель.Имя);
	ФИОПодписанта.Вставить("Отчество",Организация.Руководитель.Отчество);
	
	ИсходныеДанные.Вставить("ФИОПодписанта",ФИОПодписанта);   
	
	Возврат ИсходныеДанные;
	
КонецФункции 

#КонецОбласти
